In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Customers.csv')

In [3]:
df.head(7)

    age  income  gender m_status buys
0  25.0    high    male   single   no
1  25.0    high    male  married   no
2  35.0    high    male   single  yes
3  35.0  medium    male   single  yes
4  30.0     low  female   single  yes
5  32.0     low  female   single   no
6  22.0     low  female      NaN  yes

# Verify missing values

In [4]:
print('column    missing value')
df.isnull().sum()

column    missing value

age         2
income      0
gender      0
m_status    1
buys        0
dtype: int64

# Handle the null value

In [5]:
age_mean=df.age.mean()

In [6]:
age_mean

28.65

In [7]:
df.age=df.age.fillna(age_mean)

In [8]:
m_status_mode=df.m_status.mode()
m_status_mode

0    single
dtype: object

In [9]:
df.m_status=df.m_status.fillna('single')

In [10]:
print('column    missing value')
df.isnull().sum()

column    missing value

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [51]:
df1=df.drop(['gender','income','m_status'],axis=1)

In [52]:
df1.head()

    age buys
0  25.0   no
1  25.0   no
2  35.0  yes
3  35.0  yes
4  30.0  yes

# Label Encoding without GENDER column....

In [53]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [54]:
for column in df1.columns:
    if df1[column].dtype ==np.number:
        continue
    df1[column]=le.fit_transform(df1[column])

<ipython-input-54-accde9ca63dc>:2: DeprecationWarning: Converting `np.inexact` or `np.floating` to a dtype is deprecated. The current result is `float64` which is not strictly correct.
  if df1[column].dtype ==np.number:

In [55]:
df1.head()

    age  buys
0  25.0     0
1  25.0     0
2  35.0     1
3  35.0     1
4  30.0     1

# one hot encoding for GENDER column......

In [56]:
df2=df['gender']

In [57]:
df2.head()

0      male
1      male
2      male
3      male
4    female
Name: gender, dtype: object

In [58]:
dummy=pd.get_dummies(df['gender'],drop_first=True)

In [59]:
dummy.head()

   male
0     1
1     1
2     1
3     1
4     0

In [60]:
df_new=pd.concat([df1,dummy],axis=1)

In [61]:
df_new.head()

    age  buys  male
0  25.0     0     1
1  25.0     0     1
2  35.0     1     1
3  35.0     1     1
4  30.0     1     0

# Ordinal Encoding for INCOME column

In [62]:
df.income.unique()

array(['high', 'medium', 'low'], dtype=object)

In [63]:
range=['high', 'medium', 'low']

In [64]:
from sklearn.preprocessing import OrdinalEncoder

In [65]:
ordinal=OrdinalEncoder(categories=[range])

In [66]:
encoded=ordinal.fit_transform(df[['income']])

In [67]:
new_income=pd.DataFrame(encoded,columns=['income'])

In [68]:
new_income.head()

   income
0     0.0
1     0.0
2     0.0
3     1.0
4     2.0

In [69]:
df_new2=pd.concat([df_new,new_income],axis=1)

In [70]:
df_new2.head()

    age  buys  male  income
0  25.0     0     1     0.0
1  25.0     0     1     0.0
2  35.0     1     1     0.0
3  35.0     1     1     1.0
4  30.0     1     0     2.0

# without technique  for m_status

In [105]:
df.m_status.head()

0     single
1    married
2     single
3     single
4     single
Name: m_status, dtype: object

In [106]:
df.m_status.unique()

array(['single', 'married'], dtype=object)

In [107]:
df.m_status=df.m_status.replace(['single', 'married'],[1,2])

In [110]:
df.m_status.head()

0    1
1    2
2    1
3    1
4    1
Name: m_status, dtype: int64

In [111]:
final=pd.concat([df_new2,df.m_status],axis=1)

In [114]:
final.head(8)

     age  buys  male  income  m_status
0  25.00     0     1     0.0         1
1  25.00     0     1     0.0         2
2  35.00     1     1     0.0         1
3  35.00     1     1     1.0         1
4  30.00     1     0     2.0         1
5  32.00     0     0     2.0         1
6  22.00     1     0     2.0         1
7  28.65     0     1     1.0         2